VladisM/mcu_libs/src/driver_mcu/src/gpio_afr/stm32f4/afr_STM32F423xx.h
#ifndef AFR_STM32F423XX_H_included
#define AFR_STM32F423XX_H_included

//PA0
#define AFR_PA0_EVENTOUT   AFR_15
#define AFR_PA0_TIM2_CH1   AFR_1
#define AFR_PA0_TIM2_ETR   AFR_1
#define AFR_PA0_TIM5_CH1   AFR_2
#define AFR_PA0_TIM8_ETR   AFR_3
#define AFR_PA0_UART4_TX   AFR_8
#define AFR_PA0_USART2_CTS AFR_7

//PA1
#define AFR_PA1_EVENTOUT        AFR_15
#define AFR_PA1_I2S4_SD         AFR_5
#define AFR_PA1_QUADSPI_BK1_IO3 AFR_9
#define AFR_PA1_SPI4_MOSI       AFR_5
#define AFR_PA1_TIM2_CH2        AFR_1
#define AFR_PA1_TIM5_CH2        AFR_2
#define AFR_PA1_UART4_RX        AFR_8
#define AFR_PA1_USART2_RTS      AFR_7

//PA10
#define AFR_PA10_DFSDM2_DATIN3 AFR_3
#define AFR_PA10_EVENTOUT      AFR_15
#define AFR_PA10_I2S2_SD       AFR_5
#define AFR_PA10_I2S5_SD       AFR_6
#define AFR_PA10_SPI2_MOSI     AFR_5
#define AFR_PA10_SPI5_MOSI     AFR_6
#define AFR_PA10_TIM1_CH3      AFR_1
#define AFR_PA10_USART1_RX     AFR_7
#define AFR_PA10_USB_OTG_FS_ID AFR_10

//PA11
#define AFR_PA11_CAN1_RX       AFR_9
#define AFR_PA11_DFSDM2_CKIN5  AFR_3
#define AFR_PA11_EVENTOUT      AFR_15
#define AFR_PA11_I2S2_WS       AFR_5
#define AFR_PA11_SPI2_NSS      AFR_5
#define AFR_PA11_SPI4_MISO     AFR_6
#define AFR_PA11_TIM1_CH4      AFR_1
#define AFR_PA11_UART4_RX      AFR_11
#define AFR_PA11_USART1_CTS    AFR_7
#define AFR_PA11_USART6_TX     AFR_8
#define AFR_PA11_USB_OTG_FS_DM AFR_10

//PA12
#define AFR_PA12_CAN1_TX       AFR_9
#define AFR_PA12_DFSDM2_DATIN5 AFR_3
#define AFR_PA12_EVENTOUT      AFR_15
#define AFR_PA12_SPI2_MISO     AFR_5
#define AFR_PA12_SPI5_MISO     AFR_6
#define AFR_PA12_TIM1_ETR      AFR_1
#define AFR_PA12_UART4_TX      AFR_11
#define AFR_PA12_USART1_RTS    AFR_7
#define AFR_PA12_USART6_RX     AFR_8
#define AFR_PA12_USB_OTG_FS_DP AFR_10

//PA13
#define AFR_PA13_EVENTOUT       AFR_15
#define AFR_PA13_SYS_JTMS_SWDIO AFR_0

//PA14
#define AFR_PA14_EVENTOUT       AFR_15
#define AFR_PA14_SYS_JTCK_SWCLK AFR_0

//PA15
#define AFR_PA15_CAN3_TX     AFR_11
#define AFR_PA15_EVENTOUT    AFR_15
#define AFR_PA15_I2S1_WS     AFR_5
#define AFR_PA15_I2S3_WS     AFR_6
#define AFR_PA15_SAI1_MCLK_A AFR_10
#define AFR_PA15_SPI1_NSS    AFR_5
#define AFR_PA15_SPI3_NSS    AFR_6
#define AFR_PA15_SYS_JTDI    AFR_0
#define AFR_PA15_TIM2_CH1    AFR_1
#define AFR_PA15_TIM2_ETR    AFR_1
#define AFR_PA15_UART7_TX    AFR_8
#define AFR_PA15_USART1_TX   AFR_7

//PA2
#define AFR_PA2_EVENTOUT  AFR_15
#define AFR_PA2_FSMC_D4   AFR_12
#define AFR_PA2_FSMC_DA4  AFR_12
#define AFR_PA2_I2S_CKIN  AFR_5
#define AFR_PA2_TIM2_CH3  AFR_1
#define AFR_PA2_TIM5_CH3  AFR_2
#define AFR_PA2_TIM9_CH1  AFR_3
#define AFR_PA2_USART2_TX AFR_7

//PA3
#define AFR_PA3_EVENTOUT  AFR_15
#define AFR_PA3_FSMC_D5   AFR_12
#define AFR_PA3_FSMC_DA5  AFR_12
#define AFR_PA3_I2S2_MCK  AFR_5
#define AFR_PA3_SAI1_SD_B AFR_10
#define AFR_PA3_TIM2_CH4  AFR_1
#define AFR_PA3_TIM5_CH4  AFR_2
#define AFR_PA3_TIM9_CH2  AFR_3
#define AFR_PA3_USART2_RX AFR_7

//PA4
#define AFR_PA4_DFSDM1_DATIN1 AFR_8
#define AFR_PA4_EVENTOUT      AFR_15
#define AFR_PA4_FSMC_D6       AFR_12
#define AFR_PA4_FSMC_DA6      AFR_12
#define AFR_PA4_I2S1_WS       AFR_5
#define AFR_PA4_I2S3_WS       AFR_6
#define AFR_PA4_SPI1_NSS      AFR_5
#define AFR_PA4_SPI3_NSS      AFR_6
#define AFR_PA4_USART2_CK     AFR_7

//PA5
#define AFR_PA5_DFSDM1_CKIN1 AFR_8
#define AFR_PA5_EVENTOUT     AFR_15
#define AFR_PA5_FSMC_D7      AFR_12
#define AFR_PA5_FSMC_DA7     AFR_12
#define AFR_PA5_I2S1_CK      AFR_5
#define AFR_PA5_SPI1_SCK     AFR_5
#define AFR_PA5_TIM2_CH1     AFR_1
#define AFR_PA5_TIM2_ETR     AFR_1
#define AFR_PA5_TIM8_CH1N    AFR_3

//PA6
#define AFR_PA6_DFSDM2_CKIN1    AFR_7
#define AFR_PA6_EVENTOUT        AFR_15
#define AFR_PA6_I2S2_MCK        AFR_6
#define AFR_PA6_QUADSPI_BK2_IO0 AFR_10
#define AFR_PA6_SDIO_CMD        AFR_12
#define AFR_PA6_SPI1_MISO       AFR_5
#define AFR_PA6_TIM13_CH1       AFR_9
#define AFR_PA6_TIM1_BKIN       AFR_1
#define AFR_PA6_TIM3_CH1        AFR_2
#define AFR_PA6_TIM8_BKIN       AFR_3

//PA7
#define AFR_PA7_DFSDM2_DATIN1   AFR_7
#define AFR_PA7_EVENTOUT        AFR_15
#define AFR_PA7_I2S1_SD         AFR_5
#define AFR_PA7_QUADSPI_BK2_IO1 AFR_10
#define AFR_PA7_SPI1_MOSI       AFR_5
#define AFR_PA7_TIM14_CH1       AFR_9
#define AFR_PA7_TIM1_CH1N       AFR_1
#define AFR_PA7_TIM3_CH2        AFR_2
#define AFR_PA7_TIM8_CH1N       AFR_3

//PA8
#define AFR_PA8_CAN3_RX        AFR_11
#define AFR_PA8_DFSDM1_CKOUT   AFR_6
#define AFR_PA8_EVENTOUT       AFR_15
#define AFR_PA8_I2C3_SCL       AFR_4
#define AFR_PA8_RCC_MCO_1      AFR_0
#define AFR_PA8_SDIO_D1        AFR_12
#define AFR_PA8_TIM1_CH1       AFR_1
#define AFR_PA8_UART7_RX       AFR_8
#define AFR_PA8_USART1_CK      AFR_7
#define AFR_PA8_USB_OTG_FS_SOF AFR_10

//PA9
#define AFR_PA9_DFSDM2_CKIN3    AFR_3
#define AFR_PA9_EVENTOUT        AFR_15
#define AFR_PA9_I2C3_SMBA       AFR_4
#define AFR_PA9_I2S2_CK         AFR_5
#define AFR_PA9_SDIO_D2         AFR_12
#define AFR_PA9_SPI2_SCK        AFR_5
#define AFR_PA9_TIM1_CH2        AFR_1
#define AFR_PA9_USART1_TX       AFR_7
#define AFR_PA9_USB_OTG_FS_VBUS AFR_10

//PB0
#define AFR_PB0_EVENTOUT  AFR_15
#define AFR_PB0_I2S5_CK   AFR_6
#define AFR_PB0_SPI5_SCK  AFR_6
#define AFR_PB0_TIM1_CH2N AFR_1
#define AFR_PB0_TIM3_CH3  AFR_2
#define AFR_PB0_TIM8_CH2N AFR_3

//PB1
#define AFR_PB1_DFSDM1_DATIN0 AFR_8
#define AFR_PB1_EVENTOUT      AFR_15
#define AFR_PB1_I2S5_WS       AFR_6
#define AFR_PB1_QUADSPI_CLK   AFR_9
#define AFR_PB1_SPI5_NSS      AFR_6
#define AFR_PB1_TIM1_CH3N     AFR_1
#define AFR_PB1_TIM3_CH4      AFR_2
#define AFR_PB1_TIM8_CH3N     AFR_3

//PB10
#define AFR_PB10_DFSDM2_CKOUT AFR_10
#define AFR_PB10_EVENTOUT     AFR_15
#define AFR_PB10_FMPI2C1_SCL  AFR_9
#define AFR_PB10_I2C2_SCL     AFR_4
#define AFR_PB10_I2S2_CK      AFR_5
#define AFR_PB10_I2S3_MCK     AFR_6
#define AFR_PB10_SDIO_D7      AFR_12
#define AFR_PB10_SPI2_SCK     AFR_5
#define AFR_PB10_TIM2_CH3     AFR_1
#define AFR_PB10_USART3_TX    AFR_7

//PB11
#define AFR_PB11_EVENTOUT  AFR_15
#define AFR_PB11_I2C2_SDA  AFR_4
#define AFR_PB11_I2S_CKIN  AFR_5
#define AFR_PB11_TIM2_CH4  AFR_1
#define AFR_PB11_USART3_RX AFR_7

//PB12
#define AFR_PB12_CAN2_RX       AFR_9
#define AFR_PB12_DFSDM1_DATIN1 AFR_10
#define AFR_PB12_EVENTOUT      AFR_15
#define AFR_PB12_FSMC_D13      AFR_12
#define AFR_PB12_FSMC_DA13     AFR_12
#define AFR_PB12_I2C2_SMBA     AFR_4
#define AFR_PB12_I2S2_WS       AFR_5
#define AFR_PB12_I2S3_CK       AFR_5
#define AFR_PB12_I2S4_WS       AFR_6
#define AFR_PB12_SPI2_NSS      AFR_5
#define AFR_PB12_SPI3_SCK      AFR_7
#define AFR_PB12_SPI4_NSS      AFR_6
#define AFR_PB12_TIM1_BKIN     AFR_1
#define AFR_PB12_UART5_RX      AFR_11
#define AFR_PB12_USART3_CK     AFR_8

//PB13
#define AFR_PB13_CAN2_TX      AFR_9
#define AFR_PB13_DFSDM1_CKIN1 AFR_10
#define AFR_PB13_EVENTOUT     AFR_15
#define AFR_PB13_FMPI2C1_SMBA AFR_4
#define AFR_PB13_I2S2_CK      AFR_5
#define AFR_PB13_I2S4_CK      AFR_6
#define AFR_PB13_SPI2_SCK     AFR_5
#define AFR_PB13_SPI4_SCK     AFR_6
#define AFR_PB13_TIM1_CH1N    AFR_1
#define AFR_PB13_UART5_TX     AFR_11
#define AFR_PB13_USART3_CTS   AFR_8

//PB14
#define AFR_PB14_DFSDM1_DATIN2 AFR_8
#define AFR_PB14_EVENTOUT      AFR_15
#define AFR_PB14_FMPI2C1_SDA   AFR_4
#define AFR_PB14_FSMC_D0       AFR_10
#define AFR_PB14_FSMC_DA0      AFR_10
#define AFR_PB14_I2S2_ext_SD   AFR_6
#define AFR_PB14_SDIO_D6       AFR_12
#define AFR_PB14_SPI2_MISO     AFR_5
#define AFR_PB14_TIM12_CH1     AFR_9
#define AFR_PB14_TIM1_CH2N     AFR_1
#define AFR_PB14_TIM8_CH2N     AFR_3
#define AFR_PB14_USART3_RTS    AFR_7

