VladisM/mcu_libs/src/driver_mcu/src/gpio_afr/stm32f4/afr_STM32F423xx.h
//PB15
#define AFR_PB15_DFSDM1_CKIN2 AFR_8
#define AFR_PB15_EVENTOUT     AFR_15
#define AFR_PB15_FMPI2C1_SCL  AFR_4
#define AFR_PB15_I2S2_SD      AFR_5
#define AFR_PB15_RTC_REFIN    AFR_0
#define AFR_PB15_SDIO_CK      AFR_12
#define AFR_PB15_SPI2_MOSI    AFR_5
#define AFR_PB15_TIM12_CH2    AFR_9
#define AFR_PB15_TIM1_CH3N    AFR_1
#define AFR_PB15_TIM8_CH3N    AFR_3

//PB2
#define AFR_PB2_DFSDM1_CKIN0 AFR_6
#define AFR_PB2_EVENTOUT     AFR_15
#define AFR_PB2_LPTIM1_OUT   AFR_1
#define AFR_PB2_QUADSPI_CLK  AFR_9

//PB3
#define AFR_PB3_CAN3_RX      AFR_11
#define AFR_PB3_EVENTOUT     AFR_15
#define AFR_PB3_FMPI2C1_SDA  AFR_4
#define AFR_PB3_I2C2_SDA     AFR_9
#define AFR_PB3_I2S1_CK      AFR_5
#define AFR_PB3_I2S3_CK      AFR_6
#define AFR_PB3_SAI1_SD_A    AFR_10
#define AFR_PB3_SPI1_SCK     AFR_5
#define AFR_PB3_SPI3_SCK     AFR_6
#define AFR_PB3_SYS_JTDO_SWO AFR_0
#define AFR_PB3_TIM2_CH2     AFR_1
#define AFR_PB3_UART7_RX     AFR_8
#define AFR_PB3_USART1_RX    AFR_7

//PB4
#define AFR_PB4_CAN3_TX     AFR_11
#define AFR_PB4_EVENTOUT    AFR_15
#define AFR_PB4_I2C3_SDA    AFR_9
#define AFR_PB4_I2S3_ext_SD AFR_5
#define AFR_PB4_SAI1_SCK_A  AFR_10
#define AFR_PB4_SDIO_D0     AFR_12
#define AFR_PB4_SPI1_MISO   AFR_5
#define AFR_PB4_SPI3_MISO   AFR_6
#define AFR_PB4_SYS_JTRST   AFR_0
#define AFR_PB4_TIM3_CH1    AFR_2
#define AFR_PB4_UART7_TX    AFR_8

//PB5
#define AFR_PB5_CAN2_RX    AFR_9
#define AFR_PB5_EVENTOUT   AFR_15
#define AFR_PB5_I2C1_SMBA  AFR_4
#define AFR_PB5_I2S1_SD    AFR_5
#define AFR_PB5_I2S3_SD    AFR_6
#define AFR_PB5_LPTIM1_IN1 AFR_1
#define AFR_PB5_SAI1_FS_A  AFR_10
#define AFR_PB5_SDIO_D3    AFR_12
#define AFR_PB5_SPI1_MOSI  AFR_5
#define AFR_PB5_SPI3_MOSI  AFR_6
#define AFR_PB5_TIM3_CH2   AFR_2
#define AFR_PB5_UART5_RX   AFR_11

//PB6
#define AFR_PB6_CAN2_TX         AFR_9
#define AFR_PB6_DFSDM2_CKIN7    AFR_6
#define AFR_PB6_EVENTOUT        AFR_15
#define AFR_PB6_I2C1_SCL        AFR_4
#define AFR_PB6_LPTIM1_ETR      AFR_1
#define AFR_PB6_QUADSPI_BK1_NCS AFR_10
#define AFR_PB6_SDIO_D0         AFR_12
#define AFR_PB6_TIM4_CH1        AFR_2
#define AFR_PB6_UART5_TX        AFR_11
#define AFR_PB6_USART1_TX       AFR_7

//PB7
#define AFR_PB7_DFSDM2_DATIN7 AFR_6
#define AFR_PB7_EVENTOUT      AFR_15
#define AFR_PB7_FSMC_NL       AFR_12
#define AFR_PB7_I2C1_SDA      AFR_4
#define AFR_PB7_LPTIM1_IN2    AFR_1
#define AFR_PB7_TIM4_CH2      AFR_2
#define AFR_PB7_USART1_RX     AFR_7

//PB8
#define AFR_PB8_CAN1_RX      AFR_8
#define AFR_PB8_DFSDM2_CKIN1 AFR_7
#define AFR_PB8_EVENTOUT     AFR_15
#define AFR_PB8_I2C1_SCL     AFR_4
#define AFR_PB8_I2C3_SDA     AFR_9
#define AFR_PB8_I2S5_SD      AFR_6
#define AFR_PB8_LPTIM1_OUT   AFR_1
#define AFR_PB8_SDIO_D4      AFR_12
#define AFR_PB8_SPI5_MOSI    AFR_6
#define AFR_PB8_TIM10_CH1    AFR_3
#define AFR_PB8_TIM4_CH3     AFR_2
#define AFR_PB8_UART5_RX     AFR_11

//PB9
#define AFR_PB9_CAN1_TX       AFR_8
#define AFR_PB9_DFSDM2_DATIN1 AFR_6
#define AFR_PB9_EVENTOUT      AFR_15
#define AFR_PB9_I2C1_SDA      AFR_4
#define AFR_PB9_I2C2_SDA      AFR_9
#define AFR_PB9_I2S2_WS       AFR_5
#define AFR_PB9_SDIO_D5       AFR_12
#define AFR_PB9_SPI2_NSS      AFR_5
#define AFR_PB9_TIM11_CH1     AFR_3
#define AFR_PB9_TIM4_CH4      AFR_2
#define AFR_PB9_UART5_TX      AFR_11

//PC0
#define AFR_PC0_DFSDM2_CKIN4 AFR_3
#define AFR_PC0_EVENTOUT     AFR_15
#define AFR_PC0_LPTIM1_IN1   AFR_1
#define AFR_PC0_SAI1_MCLK_B  AFR_7

//PC1
#define AFR_PC1_DFSDM2_DATIN4 AFR_3
#define AFR_PC1_EVENTOUT      AFR_15
#define AFR_PC1_LPTIM1_OUT    AFR_1
#define AFR_PC1_SAI1_SD_B     AFR_7

//PC10
#define AFR_PC10_DFSDM2_CKIN5    AFR_3
#define AFR_PC10_EVENTOUT        AFR_15
#define AFR_PC10_I2S3_CK         AFR_6
#define AFR_PC10_QUADSPI_BK1_IO1 AFR_9
#define AFR_PC10_SDIO_D2         AFR_12
#define AFR_PC10_SPI3_SCK        AFR_6
#define AFR_PC10_USART3_TX       AFR_7

//PC11
#define AFR_PC11_DFSDM2_DATIN5   AFR_3
#define AFR_PC11_EVENTOUT        AFR_15
#define AFR_PC11_FSMC_D2         AFR_10
#define AFR_PC11_FSMC_DA2        AFR_10
#define AFR_PC11_I2S3_ext_SD     AFR_5
#define AFR_PC11_QUADSPI_BK2_NCS AFR_9
#define AFR_PC11_SDIO_D3         AFR_12
#define AFR_PC11_SPI3_MISO       AFR_6
#define AFR_PC11_UART4_RX        AFR_8
#define AFR_PC11_USART3_RX       AFR_7

//PC12
#define AFR_PC12_EVENTOUT  AFR_15
#define AFR_PC12_FSMC_D3   AFR_10
#define AFR_PC12_FSMC_DA3  AFR_10
#define AFR_PC12_I2S3_SD   AFR_6
#define AFR_PC12_SDIO_CK   AFR_12
#define AFR_PC12_SPI3_MOSI AFR_6
#define AFR_PC12_UART5_TX  AFR_8
#define AFR_PC12_USART3_CK AFR_7

//PC13
#define AFR_PC13_EVENTOUT AFR_15

//PC14
#define AFR_PC14_EVENTOUT AFR_15

//PC15
#define AFR_PC15_EVENTOUT AFR_15

//PC2
#define AFR_PC2_DFSDM1_CKOUT  AFR_8
#define AFR_PC2_DFSDM2_DATIN7 AFR_3
#define AFR_PC2_EVENTOUT      AFR_15
#define AFR_PC2_FSMC_NWE      AFR_12
#define AFR_PC2_I2S2_ext_SD   AFR_6
#define AFR_PC2_LPTIM1_IN2    AFR_1
#define AFR_PC2_SAI1_SCK_B    AFR_7
#define AFR_PC2_SPI2_MISO     AFR_5

//PC3
#define AFR_PC3_DFSDM2_CKIN7 AFR_3
#define AFR_PC3_EVENTOUT     AFR_15
#define AFR_PC3_FSMC_A0      AFR_12
#define AFR_PC3_I2S2_SD      AFR_5
#define AFR_PC3_LPTIM1_ETR   AFR_1
#define AFR_PC3_SAI1_FS_B    AFR_7
#define AFR_PC3_SPI2_MOSI    AFR_5

//PC4
#define AFR_PC4_DFSDM2_CKIN2    AFR_3
#define AFR_PC4_EVENTOUT        AFR_15
#define AFR_PC4_FSMC_NE4        AFR_12
#define AFR_PC4_I2S1_MCK        AFR_5
#define AFR_PC4_QUADSPI_BK2_IO2 AFR_10

//PC5
#define AFR_PC5_DFSDM2_DATIN2   AFR_3
#define AFR_PC5_EVENTOUT        AFR_15
#define AFR_PC5_FMPI2C1_SMBA    AFR_4
#define AFR_PC5_FSMC_NOE        AFR_12
#define AFR_PC5_QUADSPI_BK2_IO3 AFR_10
#define AFR_PC5_USART3_RX       AFR_7

//PC6
#define AFR_PC6_DFSDM1_CKIN3  AFR_6
#define AFR_PC6_DFSDM2_DATIN6 AFR_7
#define AFR_PC6_EVENTOUT      AFR_15
#define AFR_PC6_FMPI2C1_SCL   AFR_4
#define AFR_PC6_FSMC_D1       AFR_10
#define AFR_PC6_FSMC_DA1      AFR_10
#define AFR_PC6_I2S2_MCK      AFR_5
#define AFR_PC6_SDIO_D6       AFR_12
#define AFR_PC6_TIM3_CH1      AFR_2
#define AFR_PC6_TIM8_CH1      AFR_3
#define AFR_PC6_USART6_TX     AFR_8

//PC7
#define AFR_PC7_DFSDM1_DATIN3 AFR_10
#define AFR_PC7_DFSDM2_CKIN6  AFR_7
#define AFR_PC7_EVENTOUT      AFR_15
#define AFR_PC7_FMPI2C1_SDA   AFR_4
#define AFR_PC7_I2S2_CK       AFR_5
#define AFR_PC7_I2S3_MCK      AFR_6
#define AFR_PC7_SDIO_D7       AFR_12
#define AFR_PC7_SPI2_SCK      AFR_5
#define AFR_PC7_TIM3_CH2      AFR_2
#define AFR_PC7_TIM8_CH2      AFR_3
#define AFR_PC7_USART6_RX     AFR_8

