VladisM/mcu_libs/src/driver_mcu/src/gpio_afr/stm32f4/afr_STM32F423xx.h
//PE2
#define AFR_PE2_EVENTOUT        AFR_15
#define AFR_PE2_FSMC_A23        AFR_12
#define AFR_PE2_I2S4_CK         AFR_5
#define AFR_PE2_I2S5_CK         AFR_6
#define AFR_PE2_QUADSPI_BK1_IO2 AFR_9
#define AFR_PE2_SAI1_MCLK_A     AFR_7
#define AFR_PE2_SPI4_SCK        AFR_5
#define AFR_PE2_SPI5_SCK        AFR_6
#define AFR_PE2_SYS_TRACECLK    AFR_0
#define AFR_PE2_UART10_RX       AFR_11

//PE3
#define AFR_PE3_EVENTOUT    AFR_15
#define AFR_PE3_FSMC_A19    AFR_12
#define AFR_PE3_SAI1_SD_B   AFR_7
#define AFR_PE3_SYS_TRACED0 AFR_0
#define AFR_PE3_UART10_TX   AFR_11

//PE4
#define AFR_PE4_DFSDM1_DATIN3 AFR_8
#define AFR_PE4_EVENTOUT      AFR_15
#define AFR_PE4_FSMC_A20      AFR_12
#define AFR_PE4_I2S4_WS       AFR_5
#define AFR_PE4_I2S5_WS       AFR_6
#define AFR_PE4_SAI1_SD_A     AFR_7
#define AFR_PE4_SPI4_NSS      AFR_5
#define AFR_PE4_SPI5_NSS      AFR_6
#define AFR_PE4_SYS_TRACED1   AFR_0

//PE5
#define AFR_PE5_DFSDM1_CKIN3 AFR_8
#define AFR_PE5_EVENTOUT     AFR_15
#define AFR_PE5_FSMC_A21     AFR_12
#define AFR_PE5_SAI1_SCK_A   AFR_7
#define AFR_PE5_SPI4_MISO    AFR_5
#define AFR_PE5_SPI5_MISO    AFR_6
#define AFR_PE5_SYS_TRACED2  AFR_0
#define AFR_PE5_TIM9_CH1     AFR_3

//PE6
#define AFR_PE6_EVENTOUT    AFR_15
#define AFR_PE6_FSMC_A22    AFR_12
#define AFR_PE6_I2S4_SD     AFR_5
#define AFR_PE6_I2S5_SD     AFR_6
#define AFR_PE6_SAI1_FS_A   AFR_7
#define AFR_PE6_SPI4_MOSI   AFR_5
#define AFR_PE6_SPI5_MOSI   AFR_6
#define AFR_PE6_SYS_TRACED3 AFR_0
#define AFR_PE6_TIM9_CH2    AFR_3

//PE7
#define AFR_PE7_DFSDM1_DATIN2   AFR_6
#define AFR_PE7_EVENTOUT        AFR_15
#define AFR_PE7_FSMC_D4         AFR_12
#define AFR_PE7_FSMC_DA4        AFR_12
#define AFR_PE7_QUADSPI_BK2_IO0 AFR_10
#define AFR_PE7_TIM1_ETR        AFR_1
#define AFR_PE7_UART7_RX        AFR_8

//PE8
#define AFR_PE8_DFSDM1_CKIN2    AFR_6
#define AFR_PE8_EVENTOUT        AFR_15
#define AFR_PE8_FSMC_D5         AFR_12
#define AFR_PE8_FSMC_DA5        AFR_12
#define AFR_PE8_QUADSPI_BK2_IO1 AFR_10
#define AFR_PE8_TIM1_CH1N       AFR_1
#define AFR_PE8_UART7_TX        AFR_8

//PE9
#define AFR_PE9_DFSDM1_CKOUT    AFR_6
#define AFR_PE9_EVENTOUT        AFR_15
#define AFR_PE9_FSMC_D6         AFR_12
#define AFR_PE9_FSMC_DA6        AFR_12
#define AFR_PE9_QUADSPI_BK2_IO2 AFR_10
#define AFR_PE9_TIM1_CH1        AFR_1

//PF0
#define AFR_PF0_EVENTOUT AFR_15
#define AFR_PF0_FSMC_A0  AFR_12
#define AFR_PF0_I2C2_SDA AFR_4

//PF1
#define AFR_PF1_EVENTOUT AFR_15
#define AFR_PF1_FSMC_A1  AFR_12
#define AFR_PF1_I2C2_SCL AFR_4

//PF10
#define AFR_PF10_EVENTOUT AFR_15
#define AFR_PF10_TIM1_ETR AFR_1
#define AFR_PF10_TIM5_CH4 AFR_2

//PF11
#define AFR_PF11_EVENTOUT AFR_15
#define AFR_PF11_TIM8_ETR AFR_3

//PF12
#define AFR_PF12_EVENTOUT  AFR_15
#define AFR_PF12_FSMC_A6   AFR_12
#define AFR_PF12_TIM8_BKIN AFR_3

//PF13
#define AFR_PF13_EVENTOUT     AFR_15
#define AFR_PF13_FMPI2C1_SMBA AFR_4
#define AFR_PF13_FSMC_A7      AFR_12

//PF14
#define AFR_PF14_EVENTOUT    AFR_15
#define AFR_PF14_FMPI2C1_SCL AFR_4
#define AFR_PF14_FSMC_A8     AFR_12

//PF15
#define AFR_PF15_EVENTOUT    AFR_15
#define AFR_PF15_FMPI2C1_SDA AFR_4
#define AFR_PF15_FSMC_A9     AFR_12

//PF2
#define AFR_PF2_EVENTOUT  AFR_15
#define AFR_PF2_FSMC_A2   AFR_12
#define AFR_PF2_I2C2_SMBA AFR_4

//PF3
#define AFR_PF3_EVENTOUT AFR_15
#define AFR_PF3_FSMC_A3  AFR_12
#define AFR_PF3_TIM5_CH1 AFR_2

//PF4
#define AFR_PF4_EVENTOUT AFR_15
#define AFR_PF4_FSMC_A4  AFR_12
#define AFR_PF4_TIM5_CH2 AFR_2

//PF5
#define AFR_PF5_EVENTOUT AFR_15
#define AFR_PF5_FSMC_A5  AFR_12
#define AFR_PF5_TIM5_CH3 AFR_2

//PF6
#define AFR_PF6_EVENTOUT        AFR_15
#define AFR_PF6_QUADSPI_BK1_IO3 AFR_9
#define AFR_PF6_SAI1_SD_B       AFR_7
#define AFR_PF6_SYS_TRACED0     AFR_0
#define AFR_PF6_TIM10_CH1       AFR_3
#define AFR_PF6_UART7_RX        AFR_8

//PF7
#define AFR_PF7_EVENTOUT        AFR_15
#define AFR_PF7_QUADSPI_BK1_IO2 AFR_9
#define AFR_PF7_SAI1_MCLK_B     AFR_7
#define AFR_PF7_SYS_TRACED1     AFR_0
#define AFR_PF7_TIM11_CH1       AFR_3
#define AFR_PF7_UART7_TX        AFR_8

//PF8
#define AFR_PF8_EVENTOUT        AFR_15
#define AFR_PF8_QUADSPI_BK1_IO0 AFR_10
#define AFR_PF8_SAI1_SCK_B      AFR_7
#define AFR_PF8_TIM13_CH1       AFR_9
#define AFR_PF8_UART8_RX        AFR_8

//PF9
#define AFR_PF9_EVENTOUT        AFR_15
#define AFR_PF9_QUADSPI_BK1_IO1 AFR_10
#define AFR_PF9_SAI1_FS_B       AFR_7
#define AFR_PF9_TIM14_CH1       AFR_9
#define AFR_PF9_UART8_TX        AFR_8

//PG0
#define AFR_PG0_CAN1_RX  AFR_9
#define AFR_PG0_EVENTOUT AFR_15
#define AFR_PG0_FSMC_A10 AFR_12
#define AFR_PG0_UART9_RX AFR_11

//PG1
#define AFR_PG1_CAN1_TX  AFR_9
#define AFR_PG1_EVENTOUT AFR_15
#define AFR_PG1_FSMC_A11 AFR_12
#define AFR_PG1_UART9_TX AFR_11

//PG10
#define AFR_PG10_EVENTOUT AFR_15
#define AFR_PG10_FSMC_NE3 AFR_12

//PG11
#define AFR_PG11_CAN2_RX   AFR_9
#define AFR_PG11_EVENTOUT  AFR_15
#define AFR_PG11_UART10_RX AFR_11

//PG12
#define AFR_PG12_CAN2_TX    AFR_9
#define AFR_PG12_EVENTOUT   AFR_15
#define AFR_PG12_FSMC_NE4   AFR_12
#define AFR_PG12_UART10_TX  AFR_11
#define AFR_PG12_USART6_RTS AFR_8

//PG13
#define AFR_PG13_EVENTOUT    AFR_15
#define AFR_PG13_FSMC_A24    AFR_12
#define AFR_PG13_SYS_TRACED2 AFR_0
#define AFR_PG13_USART6_CTS  AFR_8

//PG14
#define AFR_PG14_EVENTOUT        AFR_15
#define AFR_PG14_FSMC_A25        AFR_12
#define AFR_PG14_QUADSPI_BK2_IO3 AFR_9
#define AFR_PG14_SYS_TRACED3     AFR_0
#define AFR_PG14_USART6_TX       AFR_8

//PG15
#define AFR_PG15_EVENTOUT   AFR_15
#define AFR_PG15_USART6_CTS AFR_8

//PG2
#define AFR_PG2_EVENTOUT AFR_15
#define AFR_PG2_FSMC_A12 AFR_12

//PG3
#define AFR_PG3_EVENTOUT AFR_15
#define AFR_PG3_FSMC_A13 AFR_12

//PG4
#define AFR_PG4_EVENTOUT AFR_15
#define AFR_PG4_FSMC_A14 AFR_12

//PG5
#define AFR_PG5_EVENTOUT AFR_15
#define AFR_PG5_FSMC_A15 AFR_12

//PG6
#define AFR_PG6_EVENTOUT        AFR_15
#define AFR_PG6_QUADSPI_BK1_NCS AFR_10

//PG7
#define AFR_PG7_EVENTOUT  AFR_15
#define AFR_PG7_USART6_CK AFR_8

//PG8
#define AFR_PG8_EVENTOUT   AFR_15
#define AFR_PG8_USART6_RTS AFR_8

//PG9
#define AFR_PG9_EVENTOUT        AFR_15
#define AFR_PG9_FSMC_NE2        AFR_12
#define AFR_PG9_QUADSPI_BK2_IO2 AFR_9
#define AFR_PG9_USART6_RX       AFR_8

//PH0 
#define AFR_PH0 _EVENTOUT AFR_15

//PH1 
#define AFR_PH1 _EVENTOUT AFR_15

#endif
